'use strict';

const arr = [1, 2, 3, 6, 8];

arr.pop(); //удаляет последний элемент массива
console.log(arr); //[ 1, 2, 3, 6 ]

arr.push(10); //добавляет элемент в конец массива
console.log(arr); //[ 1, 2, 3, 6, 10 ]

////////////////////////////////////////////////////////
arr.forEach(function(item, i, arr){                         
     console.log(`${i}: ${item} внутри массива ${arr}`);    
                                                            
});
//item - элемент
//i - номер по порядку элемента(не обязательно)
//arr - сам массив(не обязательно)
////////////////////////////////////////////////////////


for (let elem of arr) {
    console.log(elem);
}

//Отличие forOf от forEach
//forOf может использовать break и continue;

const str = prompt("", "");
const products = str.split(","); //преобразует строку с разделителем "," в массив 
console.log(products); 
const glueProducts = products.join(";"); //преобразует массив с разделителем ";" в строку
products.sort(); //сортирует массив по алфавиту (если строки в массиве)

////////////////////////////////////////////////////////////////////////
products.sort(compareNum); //cортирует массив из чисел по возрастнаию
function compareNum(a, b) {
    return a - b;
}
////////////////////////////////////////////////////////////////////////